PinkFluffyUnic0rn/stm32flight/main.c
struct dsp_lpf gyroxpt1;	/*!< gyroscope x low-pass filter */
struct dsp_lpf gyroypt1;	/*!< gyroscope y low-pass filter */
struct dsp_lpf gyrozpt1;	/*!< gyroscope z low-pass filter */

struct dsp_lpf magxlpf;	/*!< gyroscope x low-pass filter */
struct dsp_lpf magylpf;	/*!< gyroscope y low-pass filter */
struct dsp_lpf magzlpf;	/*!< gyroscope z low-pass filter */

struct dsp_compl pitchcompl;	/*!< pitch low-pass filter */
struct dsp_compl rollcompl;	/*!< roll low-pass filter */
struct dsp_compl yawcompl;	/*!< yaw low-pass filter */

struct dsp_compl climbratecompl; /*!< climb rate complimentary filter */
struct dsp_compl altcompl; /*!< altitude complimentary filter */

struct dsp_pidblval pitchpv;	/*!< pitch PID context */
struct dsp_pidblval rollpv;	/*!< roll PID context */
struct dsp_pidblval pitchspv;	/*!< pitch speed PID context */
struct dsp_pidblval rollspv;	/*!< roll speed PID context */
struct dsp_pidval yawpv;	/*!< yaw PID context */
struct dsp_pidblval yawspv;	/*!< yaw speed PID context */
struct dsp_pidblval tpv;	/*!< vertical acceleration PID context */
struct dsp_pidblval cpv;	/*!< climb rate PID context */
struct dsp_pidblval apv;	/*!< altitude PID context */
/**
* @}
*/

/**
* @defgroup GLOBALSTORAGE
* @brief Global storage for sensor
	data that aquired in separate events
* @{
*/
struct qmc_data qmcdata;	/*!< magnetometer data */
struct gnss_data gnss;		/*!< GNSS data */
struct crsf_tele tele;		/*!< telemetry values */
/**
* @}
*/

/**
* @defgroup CONTROLVALUES
* @brief Control values
* @{
*/
float thrust = 0.0; /*!< motors basic thrust */
float rolltarget = 0.0; /*!< roll PID target */
float pitchtarget = 0.0; /*!< pitch PID target */
float yawtarget = 0.0; /*!< yaw PID target */
float ltm = 1.0; /*!< left-top motor thrust scaling */
float lbm = 1.0; /*!< left-bot motor thrust scaling */
float rtm = 1.0; /*!< right-top motor thrust scaling */
float rbm = 1.0; /*!< right-bot motor thrust scaling */
float en = 0.0; /*!< 1.0 when motors turned on, 0.0 otherwise */
enum ALTMODE altmode = 0; /*!< ALTMODE_POS if in altitude hold mode,
			ALTMODE_SPEED if climbrate control mode,
			ALTMODE_ACCEL if acceleration control mode */
int speedpid = 0;	/*!<  1 if only gyroscope if used for yaw
			stabilization, 0 if accelerometer is used */
int yawspeedpid = 0;	/*!< 1 if only gyroscope if used for yaw
			stabilization, 0 if magnetometer is used */
int hovermode = 0; /*!< hover mode, when throttle is
			controlled relative to hover throttle */

int elrs = 0; /*!< 1 when ELRS control is active (ELRS remote's
		channel 8 is > 50) */

/**
* @}
*/

float alt0 = 0.0;	/*!< reference altitude */
float goffset = 0.0;	/*!< free fall acceleration (g) value offset */
float gscale = 1.0;	/*!< free fall acceleration (g) value scale */

int curslot = 0; /*!< current settings slot */

struct timev evs[TEV_COUNT]; /*!< timer events */

int loops = 0; /*!< stabilization loops counter */

int loopscount = 0; /*!< stabilization loops performed in last second */

/**
* @brief Timeout counter for the ELRS reciver. Set to
	ELRS_TIMEOUT after receiving useful packet from receiver
	and decreased by 1 every second. If it falls to 0,
	quadcopter disarms.
*/
int elrstimeout = ELRS_TIMEOUT;

/**
* @brief emergency disarm triggered, further
	arming is possible only after reboot
*/
int emergencydisarm = 0;

/**
* @brief External interrupt callback. It calls interrupt handlers
	from drivers for devices that use external interrupts.
* @param pin number of pin triggered the callback
* @return none
*/
void HAL_GPIO_EXTI_Callback(uint16_t pin)
{
	if (DEVITENABLED(dev[ESP_DEV].status)) {
		dev[ESP_DEV].interrupt(dev[ESP_DEV].priv, &pin);
	}
}

/**
* @brief UART receive callback. It calls interrupt handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback
* @return none
*/
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(dev[M10_DEV].status))
		dev[M10_DEV].interrupt(dev[M10_DEV].priv, huart);

	if (DEVITENABLED(dev[CRSF_DEV].status))
		dev[CRSF_DEV].interrupt(dev[CRSF_DEV].priv, huart);

	if (DEVITENABLED(dev[UART_DEV].status))
		dev[UART_DEV].interrupt(dev[UART_DEV].priv, huart);
}

/**
* @brief UART error callback. Calls UART error handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback.
* @return none
*/
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(dev[ESP_DEV].status))
		dev[ESP_DEV].error(dev[ESP_DEV].priv, huart);
}

/**
* @brief Get battery voltage from ADC.
* @return battery voltage
*/
float batteryvoltage()
{
	uint32_t v;

	HAL_ADC_Start(&hadc1);
	HAL_ADC_PollForConversion(&hadc1, 1);

	v = HAL_ADC_GetValue(&hadc1);

	HAL_ADC_Stop(&hadc1);

	return (v / (float) 0xfff * 17.85882);
}

/**
* @brief Get ESC current from ADC.
* @return battery current in amperes
*/
float esccurrent()
{
	uint32_t v;

	HAL_ADC_Start(&hadc2);
	HAL_ADC_PollForConversion(&hadc2, 1);

	v = HAL_ADC_GetValue(&hadc2);

	HAL_ADC_Stop(&hadc2);

	return (v / (float) 0xfff * st.currscale + st.curroffset);
}

/**
* @brief DMA callback for dshot processing.
* @param hdma DMA device that triggered this callback
* @return none
*/
static void dshotdmacb(DMA_HandleTypeDef *hdma)
{
	TIM_HandleTypeDef *htim;;

	htim = (TIM_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

	// disable DMA after bit was sent
	if (hdma == htim->hdma[TIM_DMA_ID_CC1])
		__HAL_TIM_DISABLE_DMA(htim, TIM_DMA_CC1);
	else if(hdma == htim->hdma[TIM_DMA_ID_CC2])
		__HAL_TIM_DISABLE_DMA(htim, TIM_DMA_CC2);
	else if(hdma == htim->hdma[TIM_DMA_ID_CC3])
		__HAL_TIM_DISABLE_DMA(htim, TIM_DMA_CC3);
	else if(hdma == htim->hdma[TIM_DMA_ID_CC4])
		__HAL_TIM_DISABLE_DMA(htim, TIM_DMA_CC4);
}

/**
* @brief Fill buffer, that contains PWM duty cycle values of a
	a DSHOT packet using 16 bit value.
* @param buf buffer for PWM duty cycle values that is used by DMA
* @param val 16 bit value from 0 to 2047
* @param tele 1 if telemetry bit needed, 0 otherwise
*/
void dshotsetbuf(uint16_t *buf, uint16_t val, int tele)
{
	uint16_t pack;
	unsigned int csum;
	int i;

	// bit after thrust value is telemetry request,
	// so just shift because no telemetry is used
	pack = (val << 1) | tele;

	// calculate dshot checksum
	csum = (pack ^ (pack >> 4) ^ (pack >> 8) ^ (pack >> 12)) & 0xf;

	// append checksum to the packet
	pack = (pack << 4) | csum;

	// construct PWM duty cycle buffer for the packet
	for(i = 0; i < 16; i++) {
		buf[i] = (pack & 0x8000) ? DSHOT_1 : DSHOT_0;
		pack <<= 1;
	}

