PinkFluffyUnic0rn/stm32flight/main.c
	// two bits used to maintain space between packets
	buf[16] = 0;
	buf[17] = 0;
}

/**
* @brief Fill buffer, that contains PWM duty cycle values of a
	a DSHOT packet with thrust value.
* @param buf buffer for PWM duty cycle values that is used by DMA
* @param v value from 0.0 to 1.0
* @return always 0
*/
inline int dshotsetthrust(uint16_t *buf, float v)
{
	// convert motor thrust value from [0.0;1.0]
	// range to int value in [48; 2047] range
	// disable telemetry request bit
	dshotsetbuf(buf, (uint16_t) (trimuf(v) * 1999.0 + 0.5) + 48, 0);

	return 0;
}

/**
* @brief Send dshot special command to a DSHOT output.
* @param n a DSHOT output's number
* @param cmd command number
* @return always 0
*/
int dshotcmd(int n, uint16_t cmd)
{
	static uint16_t dsbuf[18];
	DMA_HandleTypeDef *hdma;
	int timcc;
	volatile uint32_t *ccr;
	int i;

	// select DMA device, TIM channel and CCR
	// register corresponding to the DSHOT output
	switch (n) {
	case 0:
		hdma = htim1.hdma[TIM_DMA_ID_CC1];
		timcc = TIM_DMA_CC1;
		ccr = &(htim1.Instance->CCR1);
		break;

	case 1:
		hdma = htim1.hdma[TIM_DMA_ID_CC2];
		timcc = TIM_DMA_CC2;
		ccr = &(htim1.Instance->CCR2);
		break;

	case 2:
		hdma = htim1.hdma[TIM_DMA_ID_CC3];
		timcc = TIM_DMA_CC3;
		ccr = &(htim1.Instance->CCR3);
		break;

	case 3:
		hdma = htim1.hdma[TIM_DMA_ID_CC4];
		timcc = TIM_DMA_CC4;
		ccr = &(htim1.Instance->CCR4);
		break;

	default:
		return 0;
	}

	// construst a PWM duty cycle buffer for dshot ESC
	dshotsetbuf(dsbuf, cmd, 1);

	// wait for previous DSHOT packet to finish
	udelay(100);

	// send packet with command 10 times. Specification
	// requires 6 for most command, 10 is to be sure.
	for (i = 0; i < 10; ++i) {
		// instruct DMA to use the buffer
		// for stream corresponding to DSHOT output
		HAL_DMA_Start_IT(hdma, (uint32_t) dsbuf,
			(uint32_t) ccr, 18);

		// Enable DMA for stream corresponding to DSHOT output
		__HAL_TIM_ENABLE_DMA(&htim1, timcc);

		// wait for previous command packet to finish
		udelay(100);
	}

	return 0;
}

/**
* @brief Set motors thrust. All values should be between 0.0 and 1.0.
* @param left-top motor thrust
* @param right-top motor thrust
* @param left-bottom motor thrust
* @param right-bottom motor thrust
* @return always 0
*/
int setthrust(float ltd, float rtd, float lbd, float rbd)
{
	static uint16_t dsbuf[4][18];

	/*
	      ltd    rtd
		\    /
	   p     \  /
	   |
	   v     /  \
		/    \
	      lbd    rbd

		 <- r
	*/

	if (isnan(ltd) || isnan(rtd) || isnan(rbd)
		|| isnan(lbd) || !elrs)
		ltd = rtd = rbd = lbd = 0.0;

	// put motors thrust values into log
	log_write(LOG_LT, ltd);
	log_write(LOG_LB, lbd);
	log_write(LOG_RB, rbd);
	log_write(LOG_RT, rtd);

	// construst a PWM duty cycle
	// buffers for dshot ESCs
	dshotsetthrust(dsbuf[st.lt], ltd);
	dshotsetthrust(dsbuf[st.lb], lbd);
	dshotsetthrust(dsbuf[st.rt], rtd);
	dshotsetthrust(dsbuf[st.rb], rbd);

	// instruct DMA to use the buffers
	// for streams corresponding to DSHOT ESCs
	HAL_DMA_Start_IT(htim1.hdma[TIM_DMA_ID_CC1],
		(uint32_t) dsbuf[0],
		(uint32_t) &(htim1.Instance->CCR1), 18);
	HAL_DMA_Start_IT(htim1.hdma[TIM_DMA_ID_CC2],
		(uint32_t) dsbuf[1],
		(uint32_t) &(htim1.Instance->CCR2), 18);
	HAL_DMA_Start_IT(htim1.hdma[TIM_DMA_ID_CC3],
		(uint32_t) dsbuf[2],
		(uint32_t) &(htim1.Instance->CCR3), 18);
	HAL_DMA_Start_IT(htim1.hdma[TIM_DMA_ID_CC4],
		(uint32_t) dsbuf[3],
		(uint32_t) &(htim1.Instance->CCR4), 18);

	// Enable DMA for streams corresponding to DSHOT ESCs
	__HAL_TIM_ENABLE_DMA(&htim1, TIM_DMA_CC1);
	__HAL_TIM_ENABLE_DMA(&htim1, TIM_DMA_CC2);
	__HAL_TIM_ENABLE_DMA(&htim1, TIM_DMA_CC3);
	__HAL_TIM_ENABLE_DMA(&htim1, TIM_DMA_CC4);

	return 0;
}

/**
* @brief Init ESC's.
* @return none
*/
static void esc_init()
{
	__HAL_TIM_SET_AUTORELOAD(&htim1, DSHOT_BITLEN);

	// set dshot DMA callback for TIM channels
	// corresponding to DSHOT escs
	htim1.hdma[TIM_DMA_ID_CC1]->XferCpltCallback = dshotdmacb;
	htim1.hdma[TIM_DMA_ID_CC2]->XferCpltCallback = dshotdmacb;
	htim1.hdma[TIM_DMA_ID_CC3]->XferCpltCallback = dshotdmacb;
	htim1.hdma[TIM_DMA_ID_CC4]->XferCpltCallback = dshotdmacb;

	// start PWM on TIM channels corresponding to DSHOT ESCs
  	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);

	// set zero initial thrust for every motor
	setthrust(0.0, 0.0, 0.0, 0.0);
}

/**
* @brief Init HP206c barometer.
* @return none
*/
static void dps_init()
{
	struct dps_device d;

	d.hi2c = &hi2c1;
	d.rate = DPS_RATE_32;
	d.osr = DPS_OSR_16;

	if (dps_initdevice(&d, dev + DPS_DEV) >= 0)
		uartprintf("DPS368 initilized\r\n");
	else
		uartprintf("failed to initilize DPS368\r\n");
}

/**
* @brief Init IRC tramp video transmitter.
* @return none
*/
static void irc_init()
{
	struct irc_device d;

	d.huart = &huart5;
	d.power = st.ircpower;
	d.frequency = st.ircfreq;

	if (irc_initdevice(&d, dev + IRC_DEV) >= 0)
		uartprintf("IRC device initilized\r\n");
	else
		uartprintf("failed to initilize IRC device\r\n");
}

/**
* @brief Init ICM-42688-P IMU.
* @return none
*/
static void icm_init()
{
	struct icm_device d;

	d.hspi = &hspi1;
	d.gpio = GPIOC;
	d.pin = GPIO_PIN_13;

	d.gyroscale = ICM_1000DPS;
	d.gyrorate = ICM_GYRO8K;
	d.gyroorder = ICM_GYROORDER3;
	d.gyrolpf = ICM_GYROLPFLL;
	d.accelscale = ICM_4G;
	d.accelrate = ICM_ACCEL8K;
	d.accellpf = ICM_ACCELLPFLL;
	d.accelorder = ICM_ACCELORDER3;

	if (icm_initdevice(&d, dev + ICM_DEV) >= 0)
		uartprintf("ICM-42688 initilized\r\n");
	else
		uartprintf("failed to initilize ICM-42688\r\n");
}

/**
* @brief Init QMC5883L magnetometer.
* @return none
*/
static void qmc_init()
{
	struct qmc_device d;
	
	d.hi2c = &hi2c1;
	d.scale = QMC_SCALE_8;
	d.rate = QMC_RATE_100;
	d.osr = QMC_OSR_512;

