PinkFluffyUnic0rn/stm32flight/main.c
	if (qmc_initdevice(&d, dev + QMC_DEV) >= 0)
		uartprintf("QMC5883L initilized\r\n");
	else
		uartprintf("failed to initilize QMC5883L\r\n");
}

/**
* @brief Init ESP8285.
* @return none
*/
static void espdev_init()
{
	struct esp_device d;

	d.hspi = &hspi2;
	d.csgpio = GPIOC;
	d.cspin = GPIO_PIN_0;
	d.rstgpio = GPIOC;
	d.rstpin = GPIO_PIN_14;
	d.bootgpio = GPIOC;
	d.bootpin = GPIO_PIN_15;
	d.busygpio = GPIOB;
	d.busypin = GPIO_PIN_15;
	d.intpin = GPIO_PIN_1;

	if (esp_initdevice(&d, dev + ESP_DEV) < 0) {
		uartprintf("failed to initilize ESP8266\r\n");
		return;
	}

	uartprintf("ESP8266 initilized\r\n");
}

/**
* @brief Init ERLS receiver driver.
* @return none
*/
static void crsfdev_init()
{
	struct crsf_device d;

	d.huart = &huart2;

	crsf_initdevice(&d, dev + CRSF_DEV);
}

/**
* @brief Init W25Q onboard flash memory.
* @return none
*/
static void w25dev_init()
{
	struct w25_device d;

	d.hspi = &hspi1;
	d.gpio = GPIOB;
	d.pin = GPIO_PIN_3;

	if (w25_initdevice(&d, &flashdev) < 0) {
		uartprintf("failed to initilize W25Q\r\n");
		return;
	}

	uartprintf("W25Q initilized\r\n");
}

/**
* @brief Init GNSS module.
* @return none
*/
static void m10dev_init()
{
	struct m10_device d;

	d.huart = &huart3;

	if (m10_initdevice(&d, dev + M10_DEV) < 0) {
		uartprintf("failed to initilize GPS device\r\n");
		return;
	}

	uartprintf("GPS device initilized\r\n");
}

/**
* @brief Init UART config connection.
* @return none
*/
static void uartdev_init()
{
	struct uart_device d;

	d.huart = &huart4;

	if (uart_initdevice(&d, dev + UART_DEV) < 0) {
		uartprintf("failed to initilize UART device\r\n");
		return;
	}

	uartprintf("UART device initilized\r\n");
}

/**
* @brief Init/set stabilization loop.
* @param init 1, if called during initilization, 0 otherwise
* @return always 0
*/
int setstabilize(int init)
{
	// init complementary filters contexts
	dsp_setcompl(&pitchcompl, st.atctcoef, PID_FREQ, init);
	dsp_setcompl(&rollcompl, st.atctcoef, PID_FREQ, init);
	dsp_setcompl(&yawcompl, st.yctcoef, PID_FREQ, init);

	dsp_setcompl(&climbratecompl, st.cctcoef, DPS_FREQ, init);
	dsp_setcompl(&altcompl, st.actcoef, DPS_FREQ, init);

	// init roll and pitch position PID controller contexts
	dsp_setpidbl(&pitchpv, st.p, st.i, st.d, 0.5, st.dpt1freq,
		PID_FREQ, init);
	dsp_setpidbl(&rollpv, st.p, st.i, st.d, 0.5, st.dpt1freq,
		PID_FREQ, init);

	// init roll, pitch and yaw speed PID controller contexts
	dsp_setpidbl(&pitchspv, st.sp, st.si, st.sd,
		0.5, st.dpt1freq, PID_FREQ, init);
	dsp_setpidbl(&rollspv, st.sp, st.si, st.sd,
		0.5, st.dpt1freq, PID_FREQ, init);
	dsp_setpidbl(&yawspv, st.ysp, st.ysi, st.ysd,
		0.5, st.dpt1freq, PID_FREQ, init);

	// init yaw position PID controller's context
	dsp_setpid(&yawpv, st.yp, st.yi, st.yd, st.dpt1freq,
		PID_FREQ, init);

	// init vertical acceleration PID controller's context
	dsp_setpidbl(&tpv, st.zsp, st.zsi, st.zsd, 0.5, st.dpt1freq,
		PID_FREQ, init);

	// init climbrate PID controller's context
	dsp_setpidbl(&cpv, st.cp, st.ci, st.cd, 0.5, st.dpt1freq,
		PID_FREQ, init);

	// init altitude PID controller's context
	dsp_setpidbl(&apv, st.ap, st.ai, st.ad, 0.5, st.dpt1freq,
		PID_FREQ, init);

	// init battery voltage low-pass filter
	dsp_setlpf1f(&batlpf, 100.0, POWER_FREQ, init);
	dsp_setlpf1f(&currlpf, 100.0, POWER_FREQ, init);

	// init low-pass fitlers for altitude and vertical acceleration
	dsp_setunity(&templpf, init);
	dsp_setunity(&valpf, init);
	dsp_setlpf1t(&tlpf, st.ttcoef, PID_FREQ, init);
	dsp_setlpf1t(&vtlpf, st.ttcoef, PID_FREQ, init);
	dsp_setlpf1t(&altlpf, st.ttcoef, DPS_FREQ, init);

	// init low-pass fitlers for accelerometer x, y and z axes
	dsp_setlpf1f(&accxpt1, st.accpt1freq, PID_FREQ, init);
	dsp_setlpf1f(&accypt1, st.accpt1freq, PID_FREQ, init);
	dsp_setlpf1f(&acczpt1, st.accpt1freq, PID_FREQ, init);

	// init low-pass fitlers for gyroscope x, y and z axes
	dsp_setlpf1f(&gyroxpt1, st.gyropt1freq, PID_FREQ, init);
	dsp_setlpf1f(&gyroypt1, st.gyropt1freq, PID_FREQ, init);
	dsp_setlpf1f(&gyrozpt1, st.gyropt1freq, PID_FREQ, init);

	// init low-pass fitlers for magnetometer x, y and z axes
	dsp_setlpf1f(&magxlpf, 10.0, PID_FREQ, init);
	dsp_setlpf1f(&magylpf, 10.0, PID_FREQ, init);
	dsp_setlpf1f(&magzlpf, 10.0, PID_FREQ, init);

	return 0;
}

/**
* @brief Calculate tilt compensated heading direction
	using magnetometer readings, roll value and pitch value.
* @param r roll value
* @param p pitch value
* @param x magnetometer's X axis value
* @param y magnetometer's Y axis value
* @param z magnetometer's Z axis value
* @return tilt compensated heading
*/
float qmc_heading(float r, float p, float x, float y, float z)
{
	x = st.mxsc * (x + st.mx0);
	y = st.mysc * (y + st.my0);
	z = st.mzsc * (z + st.mz0);

	x = x * cosf(p) + y * sinf(r) * sinf(p)
		- z * cosf(r) * sinf(p);
	y = y * cosf(r) + z * sinf(r);

	return circf(atan2f(y, x) + st.magdecl);
}

/**
* @brief Print quadcopter's postion and tilt data into a string.
* @param s output string
* @param md accelerometer and gyroscope data
* @param hd magnetometer data
* @return always 0
*/
int sprintpos(char *s, struct icm_data *id)
{
	s[0] = '\0';

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"%-7sx = %0.3f; y = %0.3f; z = %0.3f\r\n", "accel: ",
		(double) dsp_getlpf(&accxpt1),
		(double) dsp_getlpf(&accypt1),
		(double) dsp_getlpf(&acczpt1));	
	
	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"%-7sx = %0.3f; y = %0.3f; z = %0.3f\r\n", "gyro: ",
		(double) dsp_getlpf(&gyroxpt1),
		(double) dsp_getlpf(&gyroypt1),
		(double) dsp_getlpf(&gyrozpt1));

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"%-7sx = %0.3f; y = %0.3f; z = %0.3f\r\n",
		"accel corrected: ",
		(double) (dsp_getlpf(&accxpt1) - st.ax0),
		(double) (dsp_getlpf(&accypt1) - st.ay0),
		(double) (dsp_getlpf(&acczpt1) - st.az0));
	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"%-7sx = %0.3f; y = %0.3f; z = %0.3f\r\n",
		"gyro corrected: ",
		(double) (dsp_getlpf(&gyroxpt1) - st.gx0),
		(double) (dsp_getlpf(&gyroypt1) - st.gy0),
		(double) (dsp_getlpf(&gyrozpt1) - st.gz0));

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"roll: %0.3f; pitch: %0.3f; yaw: %0.3f\r\n",
		(double) (dsp_getcompl(&rollcompl) - st.roll0),
		(double) (dsp_getcompl(&pitchcompl) - st.pitch0),
		(double) circf(dsp_getcompl(&yawcompl) - st.yaw0));

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"z acceleration: %f\r\n",
		(double) dsp_getlpf(&tlpf));

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"vertical acceleration: %f\r\n",
		(double) dsp_getlpf(&valpf));

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"accel: %f\r\n", (double) sqrt(
			pow(dsp_getlpf(&accxpt1) - st.ax0, 2.0) 
			+ pow(dsp_getlpf(&accypt1) - st.ay0, 2.0)
			+ pow(dsp_getlpf(&acczpt1) - st.az0, 2.0)));

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"g offset: %f\r\n", (double) goffset);

	snprintf(s + strlen(s), INFOLEN - strlen(s),
		"g scale: %f\r\n", (double) gscale);

