PinkFluffyUnic0rn/stm32flight/main.c
	if (altmode == ALTMODE_POS) {
		// if altitude hold mode enabled, first use altitude
		// got from barometer readings and target altitude from
		// ELRS remote to update altitude PID controller and
		// get it's next correction value
		thrustcor = dsp_pidbl(&apv, thrust,
			dsp_getcompl(&altcompl) - alt0);

		// then use altitude correction value and climb rate
		// calculated by complimentary filter (barometer
		// differentiating and accelerometer Z-axis integration)
		// to update climb rate PID controller and get it's next
		// correction value
		thrustcor = dsp_pidbl(&cpv, thrustcor,
			dsp_getcompl(&climbratecompl));

		// and next use climb rate correction value to update
		// vertial acceleration PID controller and get next
		// thrust correction value
		thrustcor = dsp_pidbl(&tpv, thrustcor + 1.0,
			dsp_getlpf(&vtlpf)) + ht;
	}
	else if (altmode == ALTMODE_SPEED) {
		// if consttant climb rate mode, first use climb rate
		// calculated by complimentary filter (barometer
		// differentiating and accelerometer Z-axis integration)
		// and target climb rate from ELRS remote to update
		// climb rate PID controller and get it's next
		// correction value
		thrustcor = dsp_pidbl(&cpv, thrust,
			dsp_getcompl(&climbratecompl));

		// and next use climb rate correction value to update
		// vertial acceleration PID controller and get next
		// thrust correction value
		thrustcor = dsp_pidbl(&tpv, thrustcor + 1.0,
			dsp_getlpf(&vtlpf)) + ht;
	}
	else {	
		if (hovermode) {
			// if no altitude hold and hover throttle mode
			// is enabled, update vertical acceleration PID
			// controller using next low-pass filtered
			// value of vertical acceleration and target
			// got from ERLS remote
			thrustcor = dsp_pidbl(&tpv, thrust + 1.0,
				dsp_getlpf(&vtlpf)) + ht;
		}
		else {
			// if no altitude hold and hover throttle mode
			// is disabled, update thrust PID controller
			// using next low-pass filtered value of thrust
			// and target got from ERLS remote
			thrustcor = dsp_pidbl(&tpv, thrust + 1.0,
				dsp_getlpf(&tlpf));
		}
	}

	// disable I-term for all PID-controller,
	// if disarmeed of no throttle
	if (en < 0.5
		|| (altmode == ALTMODE_ACCEL && thrust < 0
			&& !hovermode)
		|| (altmode == ALTMODE_SPEED
			&& thrust < -0.95 * st.climbratemax)
		|| (altmode == ALTMODE_POS && thrust < 0.01)) {
		dsp_resetpidbls(&pitchpv);
		dsp_resetpidbls(&rollpv);
		dsp_resetpidbls(&pitchspv);
		dsp_resetpidbls(&rollspv);
		dsp_resetpids(&yawpv);
		dsp_resetpidbls(&yawspv);
		dsp_resetpidbls(&tpv);
		dsp_resetpidbls(&cpv);
		dsp_resetpidbls(&apv);
	}

	// calculate weights for motors
	// thrust calibration values
	ltm = (1.0 + st.rsc / 2) * (1.0 + st.psc / 2);
	rtm = (1.0 - st.rsc / 2) * (1.0 + st.psc / 2);
	lbm = (1.0 + st.rsc / 2) * (1.0 - st.psc / 2);
	rbm = (1.0 - st.rsc / 2) * (1.0 - st.psc / 2);

	// if final thrust is greater than
	// limit set it to the limit
	thrustcor = thrustcor > st.thrustmax ? st.thrustmax : thrustcor;

	// update motors thrust based on calculated values. For
	// quadcopter it's enought to split correction in half for
	// 3 pairs of motors: left and right for roll, top and bottom
	// for pitch and two diagonals (spinning in oposite directions)
	// for yaw.
	setthrust(en * ltm * (thrustcor + 0.5 * rollcor
			+ 0.5 * pitchcor + 0.5 * yawcor),
		en * rtm * (thrustcor - 0.5 * rollcor
			+ 0.5 * pitchcor - 0.5 * yawcor),	
		en * lbm * (thrustcor + 0.5 * rollcor
			- 0.5 * pitchcor - 0.5 * yawcor),
		en * rbm * (thrustcor - 0.5 * rollcor
			- 0.5 * pitchcor + 0.5 * yawcor));

	// update loops counter
	++loops;

	return 0;
}

/**
* @brief Check if ERLS connection is alive, disarm if not. Callback
	for TEV_CHECK periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int checkconnection(int ms)
{
	// decrease ERLS timeout counter
	if (elrstimeout != 0)
		--elrstimeout;
	
	// if timeout conter reached 0 and no ERLS
	// packet came, disarm immediately
	if (elrstimeout <= 0) {
		emergencydisarm = 1;
		setthrust(0.0, 0.0, 0.0, 0.0);
		en = 0.0;
	}

	// since it runs every 1 second update loop counter here too
	loopscount = loops;
	loops = 0;

	return 0;
}

/**
* @brief Get readings from barometer. Callback for
	TEV_DPS periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int dpsupdate(int ms)
{
	struct dps_data hd;
	float prevalt, alt;
	float dt;
	
	dt = ms / (float) TICKSPERSEC;

	dt = (dt < 0.000001) ? 0.000001 : dt;

	// if barometer isn't initilized, return
	if (dev[DPS_DEV].status != DEVSTATUS_INIT)
		return 0;

	// read barometer values
	dev[DPS_DEV].read(dev[DPS_DEV].priv, &hd,
		sizeof(struct dps_data));

	// write barometer temperature and altitude values into log
	log_write(LOG_BAR_TEMP, hd.tempf);
	log_write(LOG_BAR_ALT, hd.altf);

	prevalt = dsp_getlpf(&altlpf);

	// update altitude low-pass filter and temperature reading
	alt = dsp_updatelpf(&altlpf, hd.altf);
	dsp_updatelpf(&templpf, hd.tempf);

	// calculate climb rate from vertical acceleration and
	// barometric altitude defference using complimentary filter
	dsp_updatecompl(&climbratecompl,
		9.80665 * (dsp_getlpf(&valpf) + goffset - 1.0) * dt,
			(alt - prevalt) / dt);

	// calculate presice altitiude from climb rate and
	// barometric altitude using complimentary filter
	dsp_updatecompl(&altcompl, dsp_getcompl(&climbratecompl) * dt,
		alt);

	// write climbrate and altitude values into log
	log_write(LOG_CLIMBRATE, dsp_getcompl(&climbratecompl));
	log_write(LOG_ALT, dsp_getcompl(&altcompl));

	return 0;
}

/**
* @brief Get readings from magnetomer. Callback for TEV_QMC
	periodic event.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int qmcupdate(int ms)
{
	// if magnetometer isn't initilized, return
	if (dev[QMC_DEV].status != DEVSTATUS_INIT)
		return 0;
	// read magnetometer values
	dev[QMC_DEV].read(dev[QMC_DEV].priv, &qmcdata,
		sizeof(struct qmc_data));

	// write magnetometer values into log
	log_write(LOG_MAG_X, qmcdata.fx);
	log_write(LOG_MAG_Y, qmcdata.fy);
	log_write(LOG_MAG_Z, qmcdata.fz);

