PinkFluffyUnic0rn/stm32flight/main.c
	}
	else if (strcmp(toks[1], "syaw") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.ysp = v;
		else if (strcmp(toks[2], "i") == 0)	st.ysi = v;
		else if (strcmp(toks[2], "d") == 0)	st.ysd = v;
		else					return (-1);

		dsp_setpidbl(&yawspv, st.ysp, st.ysi, st.ysd,
			0.5, st.dpt1freq, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "throttle") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.zsp = v;
		else if (strcmp(toks[2], "i") == 0)	st.zsi = v;
		else if (strcmp(toks[2], "d") == 0)	st.zsd = v;
		else					return (-1);

		dsp_setpidbl(&tpv, st.zsp, st.zsi, st.zsd,
			0.5, st.dpt1freq, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "climbrate") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.cp = v;
		else if (strcmp(toks[2], "i") == 0)	st.ci = v;
		else if (strcmp(toks[2], "d") == 0)	st.cd = v;
		else					return (-1);

		dsp_setpidbl(&cpv, st.cp, st.ci, st.cd,
			0.5, st.dpt1freq, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "altitude") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.ap = v;
		else if (strcmp(toks[2], "i") == 0)	st.ai = v;
		else if (strcmp(toks[2], "d") == 0)	st.ad = v;
		else					return (-1);

		dsp_setpidbl(&apv, st.ap, st.ai, st.ad,
			0.5, st.dpt1freq, PID_FREQ, 0);
	}
	else
		return (-1);

	return 0;
}

/**
* @brief "flash" command handler. Write/read MCU's
	internal flash used for storing configuraton.
* @param d charter device device that got this command
* @param toks list of parsed command tokens
* @param out command's output
* @return -1 on error, 0 otherwise
*/
int flashcmd(const struct cdevice *dev, const char **toks, char *out)
{
	if (strcmp(toks[1], "write") == 0)
		writesettings(atoi(toks[2]));
	else if (strcmp(toks[1], "read") == 0)
		readsettings(atoi(toks[2]));
	else
		return (-1);

	return 0;
}

/**
* @brief "compl" command handler. Configure
	pitch/roll complimentary filters.
* @param d charter device device that got this command
* @param toks list of parsed command tokens
* @param out command's output
* @return -1 on error, 0 otherwise
*/
int complcmd(const struct cdevice *dev, const char **toks, char *out)
{
	if (strcmp(toks[1], "attitude") == 0) {
		st.atctcoef = atof(toks[2]);
		dsp_setcompl(&rollcompl, st.atctcoef, PID_FREQ, 0);
		dsp_setcompl(&pitchcompl, st.atctcoef, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "yaw") == 0) {
		st.yctcoef = atof(toks[2]);
		dsp_setcompl(&yawcompl, st.yctcoef, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "climbrate") == 0) {
		st.cctcoef = atof(toks[2]);
		dsp_setcompl(&climbratecompl, st.cctcoef, DPS_FREQ, 0);
	}
	else if (strcmp(toks[1], "altitude") == 0) {
		st.actcoef = atof(toks[2]);
		dsp_setcompl(&altcompl, st.actcoef, DPS_FREQ, 0);
	}

	return 0;
}

/**
* @brief "lpf" command handler. Configure low-pass filters.
* @param d character device device that got this command
* @param toks list of parsed command tokens
* @param out command's output
* @return -1 on error, 0 otherwise
*/
int lpfcmd(const struct cdevice *dev, const char **toks, char *out)
{
	if (strcmp(toks[1], "gyro") == 0) {
		st.gyropt1freq = atof(toks[2]);

		dsp_setlpf1f(&gyroxpt1, st.gyropt1freq, PID_FREQ, 0);
		dsp_setlpf1f(&gyroypt1, st.gyropt1freq, PID_FREQ, 0);
		dsp_setlpf1f(&gyroypt1, st.gyropt1freq, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "accel") == 0) {
		st.accpt1freq = atof(toks[2]);

		dsp_setlpf1f(&accxpt1, st.accpt1freq, PID_FREQ, 0);
		dsp_setlpf1f(&accypt1, st.accpt1freq, PID_FREQ, 0);
		dsp_setlpf1f(&accypt1, st.accpt1freq, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "d") == 0) {
		st.dpt1freq = atof(toks[2]);

		dsp_setpidbl(&pitchpv, st.p, st.i, st.d,
			0.5, st.dpt1freq, PID_FREQ, 0);
		dsp_setpidbl(&rollpv, st.p, st.i, st.d,
			0.5, st.dpt1freq, PID_FREQ, 0);
		dsp_setpidbl(&pitchspv, st.sp, st.si, st.sd,
			0.5, st.dpt1freq, PID_FREQ, 0);
		dsp_setpidbl(&rollspv, st.sp, st.si, st.sd,
			0.5, st.dpt1freq, PID_FREQ, 0);
		dsp_setpidbl(&yawspv, st.ysp, st.ysi, st.ysd,
			0.5, st.dpt1freq, PID_FREQ, 0);
		dsp_setpid(&yawpv, st.yp, st.yi, st.yd,
			st.dpt1freq, PID_FREQ, 0);
		dsp_setpidbl(&tpv, st.zsp, st.zsi, st.zsd,
			0.5, st.dpt1freq, PID_FREQ, 0);
		dsp_setpidbl(&cpv, st.cp, st.ci, st.cd,
			0.5, st.dpt1freq, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "vaccel") == 0) {
		st.ttcoef = atof(toks[2]);

		dsp_setlpf1t(&tlpf, st.ttcoef, PID_FREQ, 0);
		dsp_setlpf1t(&vtlpf, st.ttcoef, PID_FREQ, 0);
		dsp_setlpf1t(&altlpf, st.ttcoef, DPS_FREQ, 0);
	}
	else
		return (-1);

	return 0;
}

/**
* @brief "adj" command handler. Configure various offset/scale values.
* @param d character device device that got this command
* @param toks list of parsed command tokens
* @param out command's output
* @return -1 on error, 0 otherwise
*/
int adjcmd(const struct cdevice *dev, const char **toks, char *out)
{
	float v;

	v = atof(toks[2]);

	if (strcmp(toks[1], "rollthrust") == 0)		st.rsc = v;
	else if (strcmp(toks[1], "pitchthrust") == 0)	st.psc = v;
	else if (strcmp(toks[1], "roll") == 0)		st.roll0 = v;
	else if (strcmp(toks[1], "pitch") == 0)		st.pitch0 = v;
	else if (strcmp(toks[1], "yaw") == 0)		st.yaw0 = v;
	else if (strcmp(toks[1], "acc") == 0) {
		if (strcmp(toks[2], "x") == 0)
			st.ax0 = atof(toks[3]);
		else if (strcmp(toks[2], "y") == 0)
			st.ay0 = atof(toks[3]);
		else if (strcmp(toks[2], "z") == 0)
			st.az0 = atof(toks[3]);
		else
			return (-1);
	}
	else if (strcmp(toks[1], "gyro") == 0) {
		if (strcmp(toks[2], "x") == 0)
			st.gx0 = atof(toks[3]);
		else if (strcmp(toks[2], "y") == 0)
			st.gy0 = atof(toks[3]);
		else if (strcmp(toks[2], "z") == 0)
			st.gz0 = atof(toks[3]);
		else
			return (-1);
	}
	else if (strcmp(toks[1], "mag") == 0) {
		if (strcmp(toks[2], "x0") == 0)
			st.mx0 = atof(toks[3]);
		else if (strcmp(toks[2], "y0") == 0)
			st.my0 = atof(toks[3]);
		else if (strcmp(toks[2], "z0") == 0)
			st.mz0 = atof(toks[3]);
		else if (strcmp(toks[2], "xscale") == 0)
			st.mxsc = atof(toks[3]);
		else if (strcmp(toks[2], "yscale") == 0)
			st.mysc = atof(toks[3]);
		else if (strcmp(toks[2], "zscale") == 0)
			st.mzsc = atof(toks[3]);
		else if (strcmp(toks[2], "decl") == 0)
			st.magdecl = atof(toks[3]);
		else
			return (-1);
	}
	else if (strcmp(toks[1], "curr") == 0) {
		if (strcmp(toks[2], "offset") == 0)
			st.curroffset = atof(toks[3]);
		else if (strcmp(toks[2], "scale") == 0)
			st.currscale = atof(toks[3]);
		else
			return (-1);
	}
	else if (strcmp(toks[1], "althold") == 0) {
		if (strcmp(toks[2], "hover") == 0)
			st.hoverthrottle = atof(toks[3]);
		else
			return (-1);
	}
	else
		return (-1);

