PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

/**
* @brief "log" command handler. Start/stop/get flight log.
* @param d character device device that got this command
* @param toks list of parsed command tokens
* @param out command's output
* @return -1 on error, 0 otherwise
*/
int logcmd(const struct cdevice *d, const char **toks, char *out)
{
	char s[INFOLEN];

	if (strcmp(toks[1], "set") == 0) {
		// flash erasing process takes time and blocks
		// other actions, so disarm for safety
		en = 0.0;
		setthrust(0.0, 0.0, 0.0, 0.0);

		log_set(atoi(toks[2]), d, s);
	}
	else if (strcmp(toks[1], "rget") == 0) {
		// print records from specified range
		if (log_print(d, s, atoi(toks[2]), atoi(toks[3])) < 0)
			return (-1);

		// write end marker
		sprintf(s, "-end-\r\n");
		d->write(d->priv, s, strlen(s));
	}
	else if (strcmp(toks[1], "bget") == 0) {
		const char **p;

		// print every record whose number is in arguments
		for (p = toks + 2; strlen(*p) != 0; ++p) {
			if (log_print(d, s, atoi(*p), atoi(*p) + 1) < 0)
				return (-1);
		}

		// write end marker
		sprintf(s, "-end-\r\n");
		d->write(d->priv, s, strlen(s));
	}
	else if (strcmp(toks[1], "freq") == 0) {
		st.logfreq = atoi(toks[2]);

		if (st.logfreq < 0 || st.logfreq > 4096)
			st.logfreq = 128;

		modifytimev(evs + TEV_LOG, st.logfreq);

		return 0;
	}
	else if (strcmp(toks[1], "record") == 0) {
		if (strcmp(toks[2], "size") == 0) {
			unsigned int p;

			for (p = 1; p < atoi(toks[3]); p <<= 1);

			if (p > LOG_MAXRECSIZE)
				p = LOG_MAXRECSIZE;

			st.logrecsize = p;
		}
		else {
			int strn;
			int i;

			if (strcmp(toks[3], "none") == 0)
				return 0;

			if ((strn = log_fieldstrn(toks[3])) < 0)
				return (-1);

			for (i = 0; i < LOG_FIELDSTRSIZE; ++i) {
				if (st.fieldid[i] == atoi(toks[2]))
					st.fieldid[i] = 99;
			}

			st.fieldid[strn] = atoi(toks[2]);
		}
		
		return 0;
	}
	else
		return (-1);

	return 1;
}


/**
* @brief "ctrl" command handler. Configure control ranges scaling.
* @param d character device device that got this command
* @param toks list of parsed command tokens
* @param out command's output
* @return -1 on error, 0 otherwise
*/
int ctrlcmd(const struct cdevice *d, const char **toks, char *out)
{
	float v;

	v = atof(toks[2]);

	if (strcmp(toks[1], "thrust") == 0)
		st.thrustmax = v;
	else if (strcmp(toks[1], "roll") == 0)
		st.rollmax = v;
	else if (strcmp(toks[1], "pitch") == 0)
		st.pitchmax = v;
	else if (strcmp(toks[1], "yaw") == 0)
		st.yawtargetspeed = v;
	else if (strcmp(toks[1], "sroll") == 0)
		st.rollspeed = v;
	else if (strcmp(toks[1], "spitch") == 0)
		st.pitchspeed = v;
	else if (strcmp(toks[1], "syaw") == 0)
		st.yawspeed = v;
	else if (strcmp(toks[1], "accel") == 0)
		st.accelmax = v;
	else if (strcmp(toks[1], "climbrate") == 0)
		st.climbratemax = v;
	else if (strcmp(toks[1], "altmax") == 0)
		st.altmax = v;
	else
		return (-1);

	return 0;
}

/**
* @brief "system" command handler. Run system commands.
* @param d character device device that got this command
* @param toks list of parsed command tokens
* @param out command's output
* @return -1 on error, 0 otherwise
*/
int systemcmd(const struct cdevice *d, const char **toks, char *out)
{
	if (strcmp(toks[1], "esp") == 0) {
		if (strcmp(toks[2], "flash") == 0)
			dev[ESP_DEV].configure(dev[ESP_DEV].priv, "flash");
		else if (strcmp(toks[2], "run") == 0)
			dev[ESP_DEV].configure(dev[ESP_DEV].priv, "run");
		else
			return (-1);
	}
	else
		return (-1);

	return 0;
}

/**
* @brief "irc" command handler. Configure IRC tramp video transmitter.
* @param d character device device that got this command
* @param toks list of parsed command tokens
* @param out command's output
* @return -1 on error, 0 otherwise
*/
int irccmd(const struct cdevice *d, const char **toks, char *out)
{
	if (strcmp(toks[1], "frequency") == 0) {
		st.ircfreq = atoi(toks[2]);

		if (dev[IRC_DEV].status != DEVSTATUS_INIT)
			return 0;

		dev[IRC_DEV].configure(dev[IRC_DEV].priv, "set",
			"frequency", atoi(toks[2]));
	}
	else if (strcmp(toks[1], "power") == 0) {
		st.ircpower = atoi(toks[2]);
	
		if (dev[IRC_DEV].status != DEVSTATUS_INIT)
			return 0;

		dev[IRC_DEV].configure(dev[IRC_DEV].priv, "set",
			"power", atoi(toks[2]));
	}
	else
		return (-1);

	return 0;
}

/**
* @brief "motor" command handler. Configure motors
	output number and direction.
* @param d character device device that got this command
* @param toks list of parsed command tokens
* @param out command's output
* @return -1 on error, 0 otherwise
*/
int motorcmd(const struct cdevice *d, const char **toks, char *out)
{
	if (strcmp(toks[1], "lt") == 0) {
		if (strcmp(toks[2], "r") == 0)
			dshotcmd(st.lt, 21);
		else if (strcmp(toks[2], "d") == 0)
			dshotcmd(st.lt, 20);
		else if (strcmp(toks[2], "s") == 0) {
			dshotcmd(st.lt, 12);
			mdelay(35);
		}
		else
			st.lt = atoi(toks[2]);
	}
	else if (strcmp(toks[1], "lb") == 0) {
		if (strcmp(toks[2], "r") == 0)
			dshotcmd(st.lb, 21);
		else if (strcmp(toks[2], "d") == 0)
			dshotcmd(st.lb, 20);
		else if (strcmp(toks[2], "s") == 0) {
			dshotcmd(st.lb, 12);
			mdelay(35);
		}
		else
			st.lb = atoi(toks[2]);
	}
	else if (strcmp(toks[1], "rb") == 0) {
		if (strcmp(toks[2], "r") == 0)
			dshotcmd(st.rb, 21);
		else if (strcmp(toks[2], "d") == 0)
			dshotcmd(st.rb, 20);
		else if (strcmp(toks[2], "s") == 0) {
			dshotcmd(st.rb, 12);
			mdelay(35);
		}
		else
			st.rb = atoi(toks[2]);
	}
	else if (strcmp(toks[1], "rt") == 0) {
		if (strcmp(toks[2], "r") == 0)
			dshotcmd(st.rt, 21);
		else if (strcmp(toks[2], "d") == 0)
			dshotcmd(st.rt, 20);
		else if (strcmp(toks[2], "s") == 0) {
			dshotcmd(st.rt, 12);
			mdelay(35);
		}
		else
			st.rt = atoi(toks[2]);
	}
	else
		return (-1);

	return 0;
}

/**
* @brief "get" command handler. Get current configuration values.
* @param d character device device that got this command
* @param toks list of parsed command tokens
* @param out command's output
* @return -1 on error, 1 otherwise
*/
int getcmd(const struct cdevice *d, const char **toks, char *out)
{
	const char **p;
	char *data;
	enum CONFVALTYPE valtype;
	float v;
	int vi;
	const char *si;

