PinkFluffyUnic0rn/stm32flight/main.c
	valtype = CONFVALTYPE_FLOAT;

	if (strcmp(toks[1], "pid") == 0) {
		if (strcmp(toks[2], "tilt") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.p;
			else if (strcmp(toks[3], "i") == 0)
				v = st.i;
			else if (strcmp(toks[3], "d") == 0)
				v = st.d;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "stilt") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.sp;
			else if (strcmp(toks[3], "i") == 0)
				v = st.si;
			else if (strcmp(toks[3], "d") == 0)
				v = st.sd;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "yaw") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.yp;
			else if (strcmp(toks[3], "i") == 0)
				v = st.yi;
			else if (strcmp(toks[3], "d") == 0)
				v = st.yd;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "syaw") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.ysp;
			else if (strcmp(toks[3], "i") == 0)
				v = st.ysi;
			else if (strcmp(toks[3], "d") == 0)
				v = st.ysd;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "throttle") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.zsp;
			else if (strcmp(toks[3], "i") == 0)
				v = st.zsi;
			else if (strcmp(toks[3], "d") == 0)
				v = st.zsd;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "climbrate") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.cp;
			else if (strcmp(toks[3], "i") == 0)
				v = st.ci;
			else if (strcmp(toks[3], "d") == 0)
				v = st.cd;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "altitude") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.ap;
			else if (strcmp(toks[3], "i") == 0)
				v = st.ai;
			else if (strcmp(toks[3], "d") == 0)
				v = st.ad;
			else
				return (-1);
		}
		else
			return (-1);
	
		valtype = CONFVALTYPE_FLOAT;
	}
	else if (strcmp(toks[1], "compl") == 0) {
		if (strcmp(toks[2], "attitude") == 0)
			v = st.atctcoef;
		else if (strcmp(toks[2], "yaw") == 0)
			v = st.yctcoef;
		else if (strcmp(toks[2], "climbrate") == 0)
			v = st.cctcoef;
		else if (strcmp(toks[2], "altitude") == 0)
			v = st.actcoef;
		else
			return (-1);

		valtype = CONFVALTYPE_FLOAT;
	}
	else if (strcmp(toks[1], "lpf") == 0) {
		if (strcmp(toks[2], "gyro") == 0)
			v = st.gyropt1freq;
		else if (strcmp(toks[2], "accel") == 0)
			v = st.accpt1freq;
		else if (strcmp(toks[2], "d") == 0)
			v = st.dpt1freq;
		else if (strcmp(toks[2], "vaccel") == 0)
			v = st.ttcoef;
		else
			return (-1);

		valtype = CONFVALTYPE_FLOAT;
	}
	else if (strcmp(toks[1], "adj") == 0) {
		if (strcmp(toks[2], "rollthrust") == 0)
			v = st.rsc;
		else if (strcmp(toks[2], "pitchthrust") == 0)
			v = st.psc;
		else if (strcmp(toks[2], "roll") == 0)
			v = st.roll0;
		else if (strcmp(toks[2], "pitch") == 0)
			v = st.pitch0;
		else if (strcmp(toks[2], "yaw") == 0)
			v = st.yaw0;
		else if (strcmp(toks[2], "acc") == 0) {
			if (strcmp(toks[3], "x") == 0)
				v = st.ax0;
			else if (strcmp(toks[3], "y") == 0)
				v = st.ay0;
			else if (strcmp(toks[3], "z") == 0)
				v = st.az0;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "gyro") == 0) {
			if (strcmp(toks[3], "x") == 0)
				v = st.gx0;
			else if (strcmp(toks[3], "y") == 0)
				v = st.gy0;
			else if (strcmp(toks[3], "z") == 0)
				v = st.gz0;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "mag") == 0) {
			if (strcmp(toks[3], "x0") == 0)
				v = st.mx0;
			else if (strcmp(toks[3], "y0") == 0)
				v = st.my0;
			else if (strcmp(toks[3], "z0") == 0)
				v = st.mz0;
			else if (strcmp(toks[3], "xscale") == 0)
				v = st.mxsc;
			else if (strcmp(toks[3], "yscale") == 0)
				v = st.mysc;
			else if (strcmp(toks[3], "zscale") == 0)
				v = st.mzsc;
			else if (strcmp(toks[3], "decl") == 0)
				v = st.magdecl;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "curr") == 0) {
			if (strcmp(toks[3], "offset") == 0)
				v = st.curroffset;
			else if (strcmp(toks[3], "scale") == 0)
				v = st.currscale;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "althold") == 0) {
			if (strcmp(toks[3], "hover") == 0)
				v = st.hoverthrottle;
			else
				return (-1);
		}
		else
			return (-1);

		valtype = CONFVALTYPE_FLOAT;
	}
	else if (strcmp(toks[1], "ctrl") == 0) {
		if (strcmp(toks[2], "thrust") == 0)
			v = st.thrustmax;
		else if (strcmp(toks[2], "roll") == 0)
			v = st.rollmax;
		else if (strcmp(toks[2], "pitch") == 0)
			v = st.pitchmax;
		else if (strcmp(toks[2], "yaw") == 0)
			v = st.yawtargetspeed;
		else if (strcmp(toks[2], "sroll") == 0)
			v = st.rollspeed;
		else if (strcmp(toks[2], "spitch") == 0)
			v = st.pitchspeed;
		else if (strcmp(toks[2], "syaw") == 0)
			v = st.yawspeed;
		else if (strcmp(toks[2], "accel") == 0)
			v = st.accelmax;
		else if (strcmp(toks[2], "climbrate") == 0)
			v = st.climbratemax;
		else if (strcmp(toks[2], "altmax") == 0)
			v = st.altmax;
		else
			return (-1);

		valtype = CONFVALTYPE_FLOAT;
	}
	else if (strcmp(toks[1], "irc") == 0) {
		if (strcmp(toks[2], "frequency") == 0)
			vi = st.ircfreq;
		else if (strcmp(toks[2], "power") == 0)
			vi = st.ircpower;
		else
			return (-1);

		valtype = CONFVALTYPE_INT;
	}
	else if (strcmp(toks[1], "log") == 0) {
		if (strcmp(toks[2], "freq") == 0) {
			vi = st.logfreq;
			valtype = CONFVALTYPE_INT;
		}
		else if (strcmp(toks[2], "record") == 0) {
			if (strcmp(toks[3], "size") == 0) {
				vi = st.logrecsize;
				valtype = CONFVALTYPE_INT;
			}
			else {
				int recn;
				int i;

				recn = atoi(toks[3]);

				if (recn < 0 || recn > LOG_MAXRECSIZE)
					return (-1);

				for (i = 0; i < LOG_FIELDSTRSIZE; ++i) {
					if (st.fieldid[i] == recn)
						break;
				}
			
				if (i >= LOG_FIELDSTRSIZE)
					si = "none";
				else
					si = logfieldstr[i];

				valtype = CONFVALTYPE_STRING;
			}
		}
		else
			return (-1);
			
	}	
	else if (strcmp(toks[1], "motor") == 0) {
		if (strcmp(toks[2], "lt") == 0)
			vi = st.lt;
		else if (strcmp(toks[2], "lb") == 0)
			vi = st.lb;
		else if (strcmp(toks[2], "rb") == 0)
			vi = st.rb;
		else if (strcmp(toks[2], "rt") == 0)
			vi = st.rt;
		
		valtype = 0;
	}
	else
		return (-1);

	data = out + 6;

	data[0] = '\0';
	for (p = toks + 1; *p != NULL; ++p)
		sprintf(data + strlen(data), "%s ", *p);

