PinkFluffyUnic0rn/stm32flight/main.c
	switch (valtype) {
	case CONFVALTYPE_FLOAT:
		sprintf(data + strlen(data), "%f\r\n", (double) v);
		break;

	case CONFVALTYPE_INT:
		sprintf(data + strlen(data), "%d\r\n", vi);
		break;

	case CONFVALTYPE_STRING:
		sprintf(data + strlen(data), "%s\r\n", si);
		break;
	}

	sprintf(out, "%05u", crc16((uint8_t *) data, strlen(data)));
	out[5] = ' ';

	return 1;
}

/**
* @brief Set control values using CRSF packet.
* @param cd -- CRSF packet
* @param ms -- microsecond passed from last CRSF packet
* @return always 0
*/
int crsfcmd(const struct crsf_data *cd, int ms)
{
	static float slottimeout = ELRS_PUSHTIMEOUT;
	float dt;
	int slot;

	// write first 8 channels values into log	
	log_write(LOG_CRSFCH0, cd->chf[ERLS_CH_ROLL]);
	log_write(LOG_CRSFCH1, cd->chf[ERLS_CH_PITCH]);
	log_write(LOG_CRSFCH2, cd->chf[ERLS_CH_THRUST]);
	log_write(LOG_CRSFCH3, cd->chf[ERLS_CH_YAW]);
	log_write(LOG_CRSFCH4, cd->chf[ERLS_CH_YAWMODE]);
	log_write(LOG_CRSFCH5, cd->chf[ERLS_CH_ATTMODE]);
	log_write(LOG_CRSFCH6, cd->chf[ERLS_CH_THRMODE]);
	log_write(LOG_CRSFCH7, cd->chf[ERLS_CH_ONOFF]);

	// channel 8 on remote is used to turn on/off
	// erls control. If this channel has low state, all remote
	// commands will be ignored, but packet still continue to
	// comming
	elrs = (cd->chf[ERLS_CH_ONOFF] > 0.5) ? 1 : 0;

	// update ERLS timeout as we got packet
	elrstimeout = ELRS_TIMEOUT;

	if (!elrs) {
		en = 0.0;
		setthrust(0.0, 0.0, 0.0, 0.0);

		return 0;
	}

	// get time passed from last ERLS packet
	dt = ms / (float) TICKSPERSEC;

	// channel 16 is used to select settings slot, it is
	// a 6 position switch on remote used for testing
	if (cd->chf[ERLS_CH_SETSLOT] < -0.8)		slot = 0;
	else if (cd->chf[ERLS_CH_SETSLOT] < -0.4)	slot = 1;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0)		slot = 2;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0.4)	slot = 3;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0.8)	slot = 4;
	else						slot = 5;

	// slot changed differ from current, wait some time to
	// ensure that it's not a some error, if enough time passed,
	// load settings from choosen slot
	if (slot != curslot) {
		slottimeout -= dt;

		if (slottimeout <= 0.0) {
			readsettings(slot);
			setstabilize(0);

			curslot = slot;
		}
	} else
		slottimeout = ELRS_PUSHTIMEOUT;

	// set magnetometer stabilization mode, if channel 4 has value
	// more than 0, set gyroscope only stabilization mode otherwise
	if (cd->chf[ERLS_CH_YAWMODE] > 0.0) {
		yawspeedpid = 0;

		// in magnetometer stabilization mode absolute yaw
		// value is stabilized, so target should be integrated
		yawtarget = circf(yawtarget
			+ cd->chf[ERLS_CH_YAW] * dt * M_PI
				* st.yawtargetspeed);
	}
	else {
		yawspeedpid = 1;
		yawtarget = -cd->chf[ERLS_CH_YAW] * M_PI * st.yawspeed;
	}

	// set altitude hold mode, if channel 7 has value more than 25,
	// set climbrate stabilization mode if channel 7 has value
	// between -25 and 25, set vertical acceleration mode if channel
	// 7 value is less than -25
	if (cd->chf[ERLS_CH_THRMODE] < -0.25) {
		altmode = ALTMODE_ACCEL;

		if (cd->chf[ERLS_CH_HOVER] < 0.0) {
			hovermode = 0;
			thrust = (cd->chf[ERLS_CH_THRUST] + 0.5)
				/ 1.5 * st.accelmax;
		}
		else {
			hovermode = 1;

			thrust = (cd->chf[ERLS_CH_THRUST])
				/ 2.0 * st.accelmax;
		}

	}
	else if (cd->chf[ERLS_CH_THRMODE] > 0.25) {
		altmode = ALTMODE_POS;
		thrust = (cd->chf[ERLS_CH_THRUST] + 1.0)
			/ 2.0 * st.altmax;
	}
	else {
		altmode = ALTMODE_SPEED;
		thrust = cd->chf[ERLS_CH_THRUST] * st.climbratemax;
	}

	// if channel 9 is active (it's no-fix button on remote used
	// for testing), set reference altitude from current altitude
	if (cd->chf[ERLS_CH_ALTCALIB] > 0.0) {
		alt0 = dsp_getcompl(&altcompl);
		gscale = 1.0 / dsp_getlpf(&valpf);
		goffset = 1.0 - dsp_getlpf(&valpf);
	}

	// set acceleromter stabilization mode, if channel 6 has value
	// more than 25, set gyroscope only stabilization mode, if
	// channel 6 has value between -25 and 25, disarm if channel 6
	// value is less than -25
	if (cd->chf[ERLS_CH_ATTMODE] < -0.25) {
		en = 0;
		speedpid = 0;
	}
	else if (cd->chf[ERLS_CH_ATTMODE] > 0.25) {
		en = 1;
		speedpid = 0;

		// set pitch/roll targets based on
		// channels 1-2 values (it's a joystick on most remotes)
		rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * st.rollmax);
		pitchtarget = -cd->chf[ERLS_CH_PITCH]
			* (M_PI * st.pitchmax);
	}
	else {
		en = 1;
		speedpid = 1;

		// set pitch/roll targets based on
		// channels 1-2 values (it's a joystick on most remotes)
		rolltarget = cd->chf[ERLS_CH_ROLL]
			* (M_PI * st.rollspeed);
		pitchtarget = -cd->chf[ERLS_CH_PITCH]
			* (M_PI * st.pitchspeed);
	}

	// disable thrust when motors should be
	// disabled, for additional safety
	if (en < 0.5)
		setthrust(0.0, 0.0, 0.0, 0.0);

	return 0;
}

/**
* @brief Store data got from NMEA message.
* @param nd data got from GNSS device through NMEA protocol
* @return always 0
*/
int m10msg(struct m10_data *nd)
{
	// got only altitude and signal quality data from GGA messages.
	if (nd->type == M10_TYPE_GGA) {
		gnss.altitude = nd->gga.alt;
		gnss.quality = nd->gga.quality;
		gnss.satellites = nd->gga.sats;

		return 0;
	}

	// other needed data is got from RMC
	// messages. Discard all other messages.
	if (nd->type != M10_TYPE_RMC)
		return 0;

	gnss.time = nd->rmc.time;
	memcpy(gnss.date, nd->rmc.date, 10);

	gnss.latmin = nd->rmc.latmin;
	gnss.lat = nd->rmc.lat;
	gnss.latdir = (tolower(nd->rmc.latdir) == 'n')
		? LATDIR_N : LATDIR_S;

	gnss.lonmin = nd->gga.lonmin;
	gnss.lon = nd->rmc.lon;
	gnss.londir = (tolower(nd->rmc.londir) == 'e')
		? LONDIR_E : LONDIR_W;

	gnss.magvar = nd->rmc.magvar;
	gnss.magvardir = (tolower(nd->rmc.magvardir) == 'e')
		? MAGVARDIR_E : MAGVARDIR_W;

	gnss.speed = nd->rmc.speed;
	gnss.course = nd->rmc.course;

	return 0;
}

/**
* @brief Entry point
* @return none
*/
int main(void)
{
	int elrsus;
	int i;

